Revit 2026 API

# StairsEndConnectionType Enumeration

---

The join style between a run and landing.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum StairsEndConnectionType
```
```vb
Public Enumeration StairsEndConnectionType
```
```cpp
public enum class StairsEndConnectionType
```
```fsharp
type StairsEndConnectionType
```

| Member name | Value | Description |
| --- | --- | --- |
| Notch | 1 | The run and landing are joined by a notch. |
| StraightCut | 0 | The run and landing are joined by a straight cut. |

#### Reference

Autodesk.Revit.DB.Architecture Namespace